{
	"title": "沈阳麻将是辽宁省沈阳地区特有的麻将玩法，其独特的玩法，超高的娱乐性一直深受广大沈阳麻友的喜爱。沈阳麻将拥有条、筒、万牌各36张，红中、发财、白板各4张，东西南北风各4张，共136张牌。游戏中庄家起手14张手牌，其余玩家13张手牌。当剩余最后4张牌的时候进行分张，分张得到的牌只能自摸胡牌，而不能出手和杠。",
	"content": {
		"1": {
			"desc": "庄家规则",
			"list": {
				"1": "1）坐庄：第一局系统将随机选择一个玩家作为庄家，所有玩家按照逆时针的顺序轮流坐庄。",
				"2": "2）连庄：本局庄家胡牌或所有人都没有胡牌，则下一局开始后庄家继续坐庄。",
				"3": "3）下庄：本局为庄家以外的人胡牌，则下一局按照逆时针的方向，轮到本局庄家的下一家坐庄。"
			}
		},
		"2": {
			"desc": "胡牌规则和限制",
			"list": {
				"1": "1）如果没有勾选闷听选项，必须开门才能胡牌。",
				"2": "2）牌局不强制扣听，不报听也可以胡牌。但是如果闷听胡牌，必须报听胡牌或者开门胡牌。报听加倍为可选择项。",
				"3": "3）不能缺少幺九牌，但是可以单独胡幺九牌，如果不能单胡幺九牌，又缺少幺九，则不能听牌或胡牌。（七小对除外）。",
				"4": "4）玩家手中至少有一副叉牌或刻牌（三张相同的），或必须胡对倒胡，否则不能胡牌或听牌。（七小对除外）。",
				"5": "5）有字牌、风牌可免幺九，有对红中、发财、白板或者喜杠、旋风杠，可免叉。",
				"6": "6）如果玩家手牌中有“中、发、白”任意2张，其他手牌为顺子和1个对子，可以胡第3张，算夹胡，如果飘牌则算单飘胡。且胡牌后，算一个喜杠。",
				"7": "7）条、筒、万必须三色全，不允许清一色（七小对除外）。",
				"8": "8）如果没有勾选吃开门可选项，只能碰牌开门，否则在碰牌前不允许吃牌。"
			}
		},
		"3": {
			"desc": "番数计算",
			"list": {
				"1": "1）屁胡（1分）：胡两边或者对倒，如34胡25。",
				"2": "2）夹胡（2分）：坎夹（13胡2）、3/7夹、单吊都算夹胡。",
				"3": "3）双飘（8分）：手中都是碰牌或杠牌，最后对倒胡，飘胡时，如果手里有“幺鸡、二条、三条”的顺子，也算飘。",
				"4": "4）单飘（16分）：手中都是碰牌或杠牌，最后单吊胡，飘胡时，如果胡“幺鸡、二条、三条”中的任意一张算单飘。",
				"5": "5）七小对（16分）：由七个对子组成的胡牌。（不再计算闷胡番数）。",
				"6": "6）缺幺胡幺（2分）：手牌里没有幺九牌，单胡幺九牌。",
				"7": "7）庄家（*2）：庄家输赢时都额外乘2。",
				"8": "8）点炮（*2/*4）：如果选择点炮包三家结算方式，点炮者需要输2倍的分数；如果选择点炮包一家结算方式，点炮者需要输4倍的分数。",
				"9": "9）自摸（*2）：自己摸到的手牌进行胡牌。",
				"10": "10）闷胡（*2）：胡牌时没有任何吃牌、碰牌或明杠牌。",
				"11": "11）报听（*2）：胡牌者报听后胡牌，报听加倍为可选择项。",
				"12": "12）门清（*2）：别人胡牌时，自己还没有开门。",
				"13": "13）杠上开花（*2）：杠牌后，从牌墙后补牌形成胡牌。",
				"14": "14）流泪（杠点炮）（*2）：胡别人补杠后打出的牌。",
				"15": "15）手把一（*2）：胡牌时，手里只剩下一张牌。",
				"16": "16）海底捞月（*2）：在牌局结束分张的时候，胡牌。",
				"17": "17）抢杠胡（*2）：胡别人要补杠的牌。",
				"18": "18）三清（*2）：胡牌时，另外三家都是门清，额外多赢1番。",
				"19": "19）封顶100：每一局牌结束，输牌者最多可以输100分，超过100分的按照100分计算。"
			}
		},
		"4": {
			"desc": "杠牌规则",
			"list": {
				"1": "1）普通杠：由4张一样的牌组成并亮出，分为明杠和暗杠，明杠是通过碰/杠别人的牌组成的杠牌，暗杠为自己摸到的手牌组成的杠牌。",
				"2": "2）喜杠：由“红中”、“发财”、“白板”组成。喜杠不算开门。",
				"3": "3）旋风杠：由“东风”、“西风”、“南风”、“北风”组成。旋风杠不算开门。",
				"4": "4）幺九杠，由“幺鸡+一万+一筒”或“九条+九饼+九万”组成，幺九杠必须在没有打出任何牌的时候才能杠出。幺九杠算开门。",
				"5": "5）大杠：由四张“红中”、“发财”或者“白板”组成的明杠和暗杠。",
				"6": "6）杠牌以加番形式乘到胡分中。",
				"7": "7）普通杠：明杠，*2/个；暗杠，*4/个，如果杠牌没有亮出不计番。",
				"8": "8）喜杠（旋风杠）：*4/个。",
				"9": "9）大杠：明杠，*4/个；暗杠，*8/个，如果杠牌没有亮出不计番。",
				"10": "10）大哥大：胡牌时，手里每有一个“红中”、“发财”、“白板”的叉牌（包括碰牌和刻牌），胡分*2/个。",
				"11": "11）当有玩家亮了喜杠时，胡牌者手里每一个“红中”、“发财”、“白板”的叉牌（包括碰牌和刻牌），胡分*4/个。",
				"12": "12）当有玩家亮了旋风杠时，胡牌者手里每一个“东风”、“西风”、“南风”、“北风”的叉牌（包括碰牌和刻牌），胡分*2/个。"
			}
		}
	}
}