/**
 * TextConfig
 * @Author Ace.c
 * @Create 2016-12-26 10:52
 */
class TextConfig {

    //游戏广播内容列表(游戏内定时显示)
    static notices: string[] = [
        "推广员咨询请联系微信：hlscmj01；关注微信公众号【欢乐川麻】，领取房卡奖励；文明娱乐，禁止赌博。"
    ];

    //错误代码提示
    static errorCodes: any = {
        1: "人已经满了！",
        2: "牌局已经开始了！",
        3: "房间不存在或已过期！",
        4: "参数不合法",
        5: "状态不合法",
        6: "已经在房间里了",
        7: "查无此人",
        8: "不能绑定你自己",
        9: "你已经有代理了",
        10: "不支持此房间类型",
        11: "未定义的code",
        12: "未定义的code",
        13: "您的房卡不够",
        14: "记录已过期",
        17: "您已经投过票了"
    };

    //聊天内容
    static chatContents: any = {
        0: {
            id: 0,
            text: "你太牛了！"
        },
        1: {
            id: 1,
            text: "哈哈，手气真好。"
        },
        2: {
            id: 2,
            text: "快点出牌呀。"
        },
        3: {
            id: 3,
            text: "今天真高兴。"
        },
        4: {
            id: 4,
            text: "你放炮，我不胡！"
        },
        5: {
            id: 5,
            text: "你家里是开银行的吧？"
        },
        6: {
            id: 6,
            text: "不好意思，我有事要先走一步啦。"
        },
        7: {
            id: 7,
            text: "你的牌打的太好了。"
        },
        8: {
            id: 8,
            text: "大家好，很高兴见到各位"
        },
        9: {
            id: 9,
            text: "怎么又断线了，网络怎么这么差呀？"
        }
    };
}